app/controllers/activities_controller.rb

  def index

    # provided by path /history/:id
    id = params[:chid]

    # find the challange either by given id (if history was requested) or by active status
    @challange = (id ? Challange.find(id) : Challange.find_by_active(true)) || Challange.new

    @teams = Team.challanged(@challange)
    @blogs = Blog.recent(@challange)

    @activities = Activity.challanged(@challange).limit(5)
    @milestones = @challange.milestones

    @blog = @blogs.first

    if @blog
      @blog.has_next = false
      @blog.has_prev = @blogs.size > 1
---
SELECT "challanges".* FROM "challanges" WHERE "challanges"."active" = 't' LIMIT 1
SELECT "blogs".* FROM "blogs" WHERE (published_at IS NOT NULL and challange_id=10) ORDER BY published_at DESC LIMIT 1
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "blogs" WHERE (published_at IS NOT NULL and challange_id=10) LIMIT 3) subquery_for_count